---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LinePatternElement
source: html/c1a8cdc4-e45e-0aa2-8aae-b47e817c3637.htm
---
# LinePatternElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.